Обработки/Reports/_ОтчетОСтатусахЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОСтатусахЗадач</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоЗадачиНаОбучениеИПроверкуЗнаний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеречнейОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОСтатусахЗадач/Ext/ObjectModule.bsl
#Область Интерфейс_внешней_обработки

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет о статусах задач",
		"0.05",
		"",
		Истина
	);
		
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "СформироватьОповещениеПоЗадачамПриВыходеНаРаботу", "Сформировать оповещение по задачам при выходе на работу",, Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "СформироватьОповещениеПоЗадачамНаОбучениеИПроверкуЗнаний", "Сформировать оповещение по задачам на обучение и проверку знаний",, Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "СформироватьОповещениеПоЗадачамСОкончаниемСрокаВПериоде", "Сформировать оповещение по задачам с окончанием срока в периоде",, Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОповеститьОНовыхЗадачах", "Оповестить о новых задачах",, Ложь, "ВызовСерверногоМетода");
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОповеститьОВсехЗадачах", "Оповестить о всех задачах",, Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для формирования отчета и отправки на почту по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	Отказ  = Ложь;

	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыКоманды, "Организация, ВидПеречня, ТолькоЗадачиНаОбучениеИПроверкуЗнаний");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ВыполнитьКоманду()";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание
	);
	
	// Формируем отчет
	Если ИдентификаторКоманды = "СформироватьОповещениеПоЗадачамНаОбучениеИПроверкуЗнаний"
	 ИЛИ ИдентификаторКоманды = "ОповеститьОВсехЗадачах" Тогда
		
		ЭтотОбъект.Период.ДатаНачала	= ДобавитьМесяц(ТекущаяДата(), -1);
		ЭтотОбъект.Период.ДатаОкончания = ТекущаяДата() + ПараметрыКоманды.СрокУведомления * 86400; 
		
		ОтправитьОповещение = Ложь;
		ДокументРезультат   = Новый ТабличныйДокумент;
		
		СформироватьОтчетПоЗадачамНаОбучениеИПроверкуЗнаний(ДокументРезультат, ОтправитьОповещение);
		
		Если ОтправитьОповещение Тогда
			РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(
				РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(),
				ПолучитьПараметрыПисьма(
					ПараметрыКоманды.ПолучателиОповещения,
					"Срок по задачам на обучение и проверку знаний истекает менее чем через " + СтрокаСЧислом(";%1 день; ;%1 дня;%1 дней;%1 дня", ПараметрыКоманды.СрокУведомления, ВидЧисловогоЗначения.Количественное, "L=ru") + ". Организация: " + Организация,
					ДокументРезультат));
		КонецЕсли;
		
	КонецЕсли;
		
	Если ИдентификаторКоманды = "СформироватьОповещениеПоЗадачамСОкончаниемСрокаВПериоде"
	 ИЛИ ИдентификаторКоманды = "ОповеститьОВсехЗадачах" Тогда
		
		ЭтотОбъект.Период.ДатаНачала	= ДобавитьМесяц(ТекущаяДата(), -1);
		ЭтотОбъект.Период.ДатаОкончания = ТекущаяДата() + ПараметрыКоманды.СрокУведомления * 86400; 
		
		ВыборкаПользователи = ПолучитьВыборкуЗадачСОкончаниемСрокаВПериоде(Справочники.Пользователи.ПустаяСсылка(), Ложь).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПользователи.Следующий() Цикл
			
			ДокументРезультат   = Новый ТабличныйДокумент;
			
			СформироватьОтчетПоЗадачамСОкончаниемСрокаВПериоде(ДокументРезультат, ВыборкаПользователи.Пользователь, ВыборкаПользователи.Выбрать());
			
			РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(
				РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(),
				ПолучитьПараметрыПисьма(
					ВыборкаПользователи.АдресЭлектроннойПочты,
					"Срок по задачам истекает менее чем через " + СтрокаСЧислом(";%1 день; ;%1 дня;%1 дней;%1 дня", ПараметрыКоманды.СрокУведомления, ВидЧисловогоЗначения.Количественное, "L=ru") + ". Организация: " + ЭтотОбъект.Организация,
					ДокументРезультат));
			
		КонецЦикла;
		
	КонецЕсли;
		
	Если ИдентификаторКоманды = "ОповеститьОНовыхЗадачах"
	 ИЛИ ИдентификаторКоманды = "ОповеститьОВсехЗадачах" Тогда
		
		ЭтотОбъект.Период		= Новый СтандартныйПериод(ВариантСтандартногоПериода.Сегодня); 
		
		ВыборкаПользователи = ПолучитьВыборкуНовыхЗадач(Справочники.Пользователи.ПустаяСсылка(), Ложь).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПользователи.Следующий() Цикл
			
			ДокументРезультат   = Новый ТабличныйДокумент;
			
			СформироватьОтчетПоНовымЗадачам(ДокументРезультат, ВыборкаПользователи.Пользователь, ВыборкаПользователи.Выбрать());
			
			РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(
				РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(),
				ПолучитьПараметрыПисьма(
					ВыборкаПользователи.АдресЭлектроннойПочты,
					"Новые задачи в 1С. Организация: " + ВыборкаПользователи.Пользователь.Организация,
					ДокументРезультат));
			
				КонецЦикла;
		
	КонецЕсли;
	
	Если ИдентификаторКоманды = "СформироватьОповещениеПоЗадачамПриВыходеНаРаботу"
	 ИЛИ ИдентификаторКоманды = "ОповеститьОВсехЗадачах" Тогда
		
		ЭтотОбъект.Период.ДатаНачала	= НачалоДня(ТекущаяДата());
		ЭтотОбъект.Период.ДатаОкончания = КонецДня(ТекущаяДата()); 
		
		ВыборкаПользователи = ПолучитьВыборкуЗадачПриВыходеНаРаботу(Справочники.Пользователи.ПустаяСсылка(), Ложь).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПользователи.Следующий() Цикл
			
			ДокументРезультат   = Новый ТабличныйДокумент;
			
			СформироватьОтчетПоЗадачамПриВыходеНаРаботу(ДокументРезультат, ВыборкаПользователи.Пользователь, ВыборкаПользователи.Выбрать());
			
			РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(
				РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(),
				ПолучитьПараметрыПисьма(
					ВыборкаПользователи.АдресЭлектроннойПочты,
					"Необходимо выполнить задачи в течении дня. Организация: " + ЭтотОбъект.Организация,
					ДокументРезультат));
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Отказ Тогда
		МассивОшибок = Новый Массив;
		
		СообщенияПользователю = ПолучитьСообщенияПользователю();
		Для Каждого СообщениеПользователю Из СообщенияПользователю Цикл
			МассивОшибок.Добавить(СообщениеПользователю.Текст);
		КонецЦикла;
		
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(МассивОшибок, ПараметрыОбработки.ДополнительнаяОбработкаСсылка);
		
	КонецЕсли;
	
	
	// Завершаем сессию сбора статистики
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	
	
	
КонецПроцедуры // ВыполнитьКоманду

Функция ПолучитьПараметрыПисьма(Кому, Тема, ДокументРезультат)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("htm");
	ДокументРезультат.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML);
	
	ТД = Новый ТекстовыйДокумент;
	ТД.Прочитать(ИмяВременногоФайла);
	
	Для НомерСтроки = 1 По ТД.КоличествоСтрок() Цикл
		ТекущаяСтрока = ТД.ПолучитьСтроку(НомерСтроки);
		Если СтрНайти(ТекущаяСтрока, "href=") > 0 Тогда
			ТекущаяСтрока = СтрЗаменить(ТекущаяСтрока, "&lt;", "<");
			ТекущаяСтрока = СтрЗаменить(ТекущаяСтрока, "&gt;", ">");
			ТекущаяСтрока = СтрЗаменить(ТекущаяСтрока, "&nbsp;", " ");
		КонецЕсли;
		ТД.УдалитьСтроку(НомерСтроки);
		ТД.ВставитьСтроку(НомерСтроки, ТекущаяСтрока);
	КонецЦикла;
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому",		Кому);
	ПараметрыПисьма.Вставить("Тема", 		Тема);
	ПараметрыПисьма.Вставить("Тело",		ТД.ПолучитьТекст());
	ПараметрыПисьма.Вставить("ТипТекста",	ТипТекстаПочтовогоСообщения.HTML);
	
	Возврат ПараметрыПисьма; 
	
КонецФункции

#КонецОбласти

#Область Сформировать

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();
	
	Если ЭтотОбъект.ВариантОтчета = "ОтчетПоЗадачамНаОбучениеИПроверкуЗнаний" Тогда
		СформироватьОтчетПоЗадачамНаОбучениеИПроверкуЗнаний(ДокументРезультат);
		
	ИначеЕсли ЭтотОбъект.ВариантОтчета = "ОтчетПоЗадачамСОкончаниемСрокаВПериоде" Тогда
		СформироватьОтчетПоЗадачамСОкончаниемСрокаВПериоде(ДокументРезультат, ЭтотОбъект.Пользователь);
		
	ИначеЕсли ЭтотОбъект.ВариантОтчета = "ОтчетПоНовымЗадачам" Тогда
		СформироватьОтчетПоНовымЗадачам(ДокументРезультат, ЭтотОбъект.Пользователь);
		
	ИначеЕсли ЭтотОбъект.ВариантОтчета = "ОтчетПоЗадачамПриВыходеНаРаботу" Тогда
		СформироватьОтчетПоЗадачамПриВыходеНаРаботу(ДокументРезультат, ЭтотОбъект.Пользователь);
		
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область ЗадачаНаОбучениеИПроверкуЗнаний

Процедура СформироватьОтчетПоЗадачамНаОбучениеИПроверкуЗнаний(ДокументРезультат, ОтправитьОповещение = Ложь)
	
	Макет = ПолучитьМакет("ОтчетПоЗадачамНаОбучениеИПроверкуЗнаний");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ОбластьШапка.Параметры.Организация = ЭтотОбъект.Организация;
	ОбластьШапка.Параметры.ВидПеречня  = ?(ЭтотОбъект.ВидПеречня.Пустая(), "Все", ЭтотОбъект.ВидПеречня);
	ОбластьШапка.Параметры.Период      = ПредставлениеПериода(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания);
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	Данные = ПолучитьТаблицуЗадачНаОбучениеИПроверкуЗнаний();
	
	Для Каждого СтрокаДанных Из Данные Цикл
		ОбластьСтрока.Параметры.Заполнить(СтрокаДанных);
		ДокументРезультат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ОтправитьОповещение = (Данные.Количество() > 0);
	
КонецПроцедуры

Функция ПолучитьТаблицуЗадачНаОбучениеИПроверкуЗнаний()

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",   ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ВидПеречня",	   ЭтотОбъект.ВидПеречня);
	Запрос.УстановитьПараметр("ДатаНачала",	   ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ЭтотОбъект.Период.ДатаОкончания);
	
	Запрос.УстановитьПараметр("ТочкаМаршрутаПройтиОбучение", БизнесПроцессы.ОбучениеСотрудника.ТочкиМаршрута.ПройтиОбучение);
	Запрос.УстановитьПараметр("ТочкаМаршрутаПроверитьЗнания", БизнесПроцессы.ОбучениеСотрудника.ТочкиМаршрута.ПроверитьЗнания);
	
#Область ТекстЗапроса

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбучениеСотрудников.Ссылка КАК ДокументОбучение,
		|	ОбучениеСотрудников.ТемаОбучения КАК ТемаОбучения,
		|	ОбучениеСотрудника.Ссылка КАК БизнесПроцессОбучение,
		|	ОбучениеСотрудника.Сотрудник КАК Сотрудник,
		|	ЗадачаНаОбучение.Ссылка КАК ЗадачаНаОбучение,
		|	ЗадачаНаОбучение.Выполнена КАК ЗадачаНаОбучениеВыполнена,
		|	ЗадачаНаПроверкуЗнаний.Ссылка КАК ЗадачаНаПроверкуЗнаний,
		|	ЗадачаНаПроверкуЗнаний.Выполнена КАК ЗадачаНаПроверкуЗнанийВыполнена,
		|	ОбучениеСотрудников.Дата КАК НачалоОбучения,
		|	ОбучениеСотрудников.ОкончаниеОбучения КАК ОкончаниеОбучения,
		|	ОбучениеСотрудников.НачалоПроверкиЗнаний КАК НачалоПроверкиЗнаний,
		|	ОбучениеСотрудников.ОкончаниеПроверкиЗнаний КАК ОкончаниеПроверкиЗнаний
		|ПОМЕСТИТЬ _ЗадачиОбученияСотрудников
		|ИЗ
		|	Документ.ОбучениеСотрудников КАК ОбучениеСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.ОбучениеСотрудника КАК ОбучениеСотрудника
		|		ПО (ОбучениеСотрудника.Основание = ОбучениеСотрудников.Ссылка)
		|			И (НЕ ОбучениеСотрудника.ПометкаУдаления)
		|			И (НЕ ОбучениеСотрудника.Отменен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачаИсполнителя КАК ЗадачаНаОбучение
		|		ПО (ОбучениеСотрудника.Ссылка = ЗадачаНаОбучение.БизнесПроцесс)
		|			И (ЗадачаНаОбучение.ТочкаМаршрута = &ТочкаМаршрутаПройтиОбучение)
		|			И (НЕ ЗадачаНаОбучение.ПометкаУдаления)
		|			И (НАЧАЛОПЕРИОДА(ЗадачаНаОбучение.Дата, ДЕНЬ) <= &ДатаОкончания)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачаИсполнителя КАК ЗадачаНаПроверкуЗнаний
		|		ПО (ОбучениеСотрудника.Ссылка = ЗадачаНаПроверкуЗнаний.БизнесПроцесс)
		|			И (ЗадачаНаПроверкуЗнаний.ТочкаМаршрута = &ТочкаМаршрутаПроверитьЗнания)
		|			И (НЕ ЗадачаНаПроверкуЗнаний.ПометкаУдаления)
		|			И (НАЧАЛОПЕРИОДА(ЗадачаНаПроверкуЗнаний.Дата, ДЕНЬ) <= &ДатаОкончания)
		|ГДЕ
		|	ОбучениеСотрудников.Организация = &Организация
		|	И &ВидПеречня В (ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.), ОбучениеСотрудников.ВидПеречня)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадачиОбученияСотрудников.Сотрудник КАК Сотрудник,
		|	_ЗадачиОбученияСотрудников.ЗадачаНаОбучение КАК Задача,
		|	_ЗадачиОбученияСотрудников.ЗадачаНаОбучение.Наименование КАК ЗадачаНаименование,
		|	_ЗадачиОбученияСотрудников.ОкончаниеОбучения КАК ДатаОкончания,
		|	_ЗадачиОбученияСотрудников.ДокументОбучение КАК Основание,
		|	_ЗадачиОбученияСотрудников.ТемаОбучения КАК ТемаОбучения,
		|	_ЗадачиОбученияСотрудников.ЗадачаНаОбучение.Исполнитель КАК Исполнитель,
		|	_ЗадачиОбученияСотрудников.ЗадачаНаОбучение.ГруппаИсполнителей КАК ГруппаИсполнителей
		|ИЗ
		|	_ЗадачиОбученияСотрудников КАК _ЗадачиОбученияСотрудников
		|ГДЕ
		|	_ЗадачиОбученияСотрудников.ЗадачаНаОбучениеВыполнена = ЛОЖЬ
		|	И _ЗадачиОбученияСотрудников.ОкончаниеОбучения МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ЗадачиОбученияСотрудников.Сотрудник,
		|	_ЗадачиОбученияСотрудников.ЗадачаНаПроверкуЗнаний,
		|	_ЗадачиОбученияСотрудников.ЗадачаНаПроверкуЗнаний.Наименование,
		|	_ЗадачиОбученияСотрудников.ОкончаниеПроверкиЗнаний,
		|	_ЗадачиОбученияСотрудников.ДокументОбучение,
		|	_ЗадачиОбученияСотрудников.ТемаОбучения,
		|	_ЗадачиОбученияСотрудников.ЗадачаНаПроверкуЗнаний.Исполнитель,
		|	_ЗадачиОбученияСотрудников.ЗадачаНаПроверкуЗнаний.ГруппаИсполнителей
		|ИЗ
		|	_ЗадачиОбученияСотрудников КАК _ЗадачиОбученияСотрудников
		|ГДЕ
		|	_ЗадачиОбученияСотрудников.ЗадачаНаПроверкуЗнанийВыполнена = ЛОЖЬ
		|	И _ЗадачиОбученияСотрудников.ОкончаниеПроверкиЗнаний МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник";
	
#КонецОбласти	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
	
#КонецОбласти

#Область ЗадачиСОкончаниемСрокаВПериоде

Процедура СформироватьОтчетПоЗадачамСОкончаниемСрокаВПериоде(ДокументРезультат, Исполнитель, Выборка = Неопределено)
	
	Макет = ПолучитьМакет("ОтчетПоЗадачамСОкончаниемСрокаВПериоде");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ОбластьШапка.Параметры.Пользователь = Исполнитель;
	ОбластьШапка.Параметры.Организация = ЭтотОбъект.Организация;
	ОбластьШапка.Параметры.ВидПеречня  = ?(ЭтотОбъект.ВидПеречня.Пустая(), "Все", ЭтотОбъект.ВидПеречня);
	ОбластьШапка.Параметры.Период      = ПредставлениеПериода(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания);
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	Если Выборка = Неопределено Тогда
		Выборка = ПолучитьВыборкуЗадачСОкончаниемСрокаВПериоде(Исполнитель, Истина).Выбрать();
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		
		Если НЕ Выборка.ИнтерактивныйЗапуск Тогда
			ОбластьСтрока.Параметры.Задача = ОбщегоНазначения.ПолучитьГиперссылкуНаОбъект(Выборка.Задача);
		КонецЕсли;
		
		ДокументРезультат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьВыборкуЗадачСОкончаниемСрокаВПериоде(Исполнитель, ИнтерактивныйЗапуск)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Исполнитель",		 Исполнитель);
	Запрос.УстановитьПараметр("Организация",		 ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ВидПеречня",		 	 ЭтотОбъект.ВидПеречня);
	Запрос.УстановитьПараметр("ДатаНачала",	   		 ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 		 ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ИнтерактивныйЗапуск", ИнтерактивныйЗапуск);
	
	Запрос.УстановитьПараметр("ТолькоЗадачиНаОбучениеИПроверкуЗнаний", ТолькоЗадачиНаОбучениеИПроверкуЗнаний);
	
	Запрос.УстановитьПараметр("ТочкаМаршрутаПройтиОбучение", БизнесПроцессы.ОбучениеСотрудника.ТочкиМаршрута.ПройтиОбучение);
	Запрос.УстановитьПараметр("ТочкаМаршрутаПроверитьЗнания", БизнесПроцессы.ОбучениеСотрудника.ТочкиМаршрута.ПроверитьЗнания);
	
#Область ТекстЗапроса

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадачаИсполнителя.Ссылка КАК Ссылка,
		|	ЗадачаИсполнителя.Наименование КАК Наименование,
		|	ЗадачаИсполнителя.Исполнитель КАК Исполнитель,
		|	ЗадачаИсполнителя.ГруппаИсполнителей КАК ГруппаИсполнителей,
		|	ЗадачаИсполнителя.СрокИсполнения КАК СрокИсполнения,
		|	ЗадачаИсполнителя.ТекстЗадачи КАК ТекстЗадачи
		|ПОМЕСТИТЬ _ЗадачаИсполнителя
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбучениеСотрудников КАК ОбучениеСотрудников
		|		ПО ЗадачаИсполнителя.Основание = ОбучениеСотрудников.Ссылка
		|ГДЕ
		|	НЕ ЗадачаИсполнителя.ПометкаУдаления
		|	И НЕ ЕСТЬNULL(ЗадачаИсполнителя.БизнесПроцесс.Отменен, ЛОЖЬ)
		|	И НЕ ЗадачаИсполнителя.Выполнена
		|	И ЗадачаИсполнителя.СрокИсполнения МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗадачаИсполнителя.Организация = &Организация
		|	И (НЕ &ТолькоЗадачиНаОбучениеИПроверкуЗнаний
		|			ИЛИ ЗадачаИсполнителя.ТочкаМаршрута В (&ТочкаМаршрутаПройтиОбучение, &ТочкаМаршрутаПроверитьЗнания))
		|	И &ВидПеречня В (ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.), ОбучениеСотрудников.ВидПеречня)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникПользователи.Ссылка КАК Пользователь,
		|	СправочникПользователи.АдресЭлектроннойПочты КАК АдресЭлектроннойПочты,
		|	_ЗадачаИсполнителя.Ссылка КАК Задача,
		|	_ЗадачаИсполнителя.Наименование КАК ЗадачаНаименование,
		|	_ЗадачаИсполнителя.Исполнитель КАК Исполнитель,
		|	_ЗадачаИсполнителя.ГруппаИсполнителей КАК ГруппаИсполнителей,
		|	_ЗадачаИсполнителя.СрокИсполнения КАК СрокИсполнения,
		|	_ЗадачаИсполнителя.ТекстЗадачи КАК ТекстЗадачи,
		|	&ИнтерактивныйЗапуск КАК ИнтерактивныйЗапуск
		|ИЗ
		|	_ЗадачаИсполнителя КАК _ЗадачаИсполнителя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставГруппПользователей КАК СоставГруппПользователей
		|		ПО (_ЗадачаИсполнителя.ГруппаИсполнителей <> ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.))
		|			И (_ЗадачаИсполнителя.ГруппаИсполнителей В (СоставГруппПользователей.ГруппаПользователей, СоставГруппПользователей.ГруппаПользователей.Родитель))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК СправочникПользователи
		|		ПО (СправочникПользователи.Ссылка В (СоставГруппПользователей.Пользователь, _ЗадачаИсполнителя.Исполнитель))
		|			И (СправочникПользователи.Организация = &Организация)
		|ГДЕ
		|	(СправочникПользователи.Ссылка = &Исполнитель
		|			ИЛИ &Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.))";
	
	Если НЕ ИнтерактивныйЗапуск Тогда
		Запрос.Текст = Запрос.Текст + "
			|ИТОГИ ПО
			|	Пользователь";
	КонецЕсли;	
	
#КонецОбласти	
	
	Возврат Запрос.Выполнить();
	
	
КонецФункции

#КонецОбласти

#Область НовыеЗадачи

Процедура СформироватьОтчетПоНовымЗадачам(ДокументРезультат, Исполнитель, Выборка = Неопределено)
	
	Макет = ПолучитьМакет("ОтчетПоНовымЗадачам");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ОбластьШапка.Параметры.Пользователь = Исполнитель;
	ОбластьШапка.Параметры.Организация = ЭтотОбъект.Организация;
	ОбластьШапка.Параметры.ВидПеречня  = ?(ЭтотОбъект.ВидПеречня.Пустая(), "Все", ЭтотОбъект.ВидПеречня);
	ОбластьШапка.Параметры.Период      = ПредставлениеПериода(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания);
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	Если Выборка = Неопределено Тогда
		Выборка = ПолучитьВыборкуНовыхЗадач(Исполнитель, Истина).Выбрать();
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		
		Если НЕ Выборка.ИнтерактивныйЗапуск Тогда
			ОбластьСтрока.Параметры.Задача = ОбщегоНазначения.ПолучитьГиперссылкуНаОбъект(Выборка.Задача);
		КонецЕсли;
		
		ДокументРезультат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьВыборкуНовыхЗадач(Исполнитель, ИнтерактивныйЗапуск)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Исполнитель",		 Исполнитель);
	Запрос.УстановитьПараметр("Организация",		 ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ВидПеречня",		 	 ЭтотОбъект.ВидПеречня);
	Запрос.УстановитьПараметр("ДатаНачала",	   		 ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 		 ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ИнтерактивныйЗапуск", ИнтерактивныйЗапуск);
	
	Запрос.УстановитьПараметр("ТолькоЗадачиНаОбучениеИПроверкуЗнаний", ТолькоЗадачиНаОбучениеИПроверкуЗнаний);
	
	Запрос.УстановитьПараметр("ТочкаМаршрутаПройтиОбучение", БизнесПроцессы.ОбучениеСотрудника.ТочкиМаршрута.ПройтиОбучение);
	Запрос.УстановитьПараметр("ТочкаМаршрутаПроверитьЗнания", БизнесПроцессы.ОбучениеСотрудника.ТочкиМаршрута.ПроверитьЗнания);
	
	
#Область ТекстЗапроса

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадачаИсполнителя.Ссылка КАК Ссылка,
		|	ЗадачаИсполнителя.Наименование КАК Наименование,
		|	ЗадачаИсполнителя.СрокИсполнения КАК СрокИсполнения,
		|	ЗадачаИсполнителя.Исполнитель КАК Исполнитель,
		|	ЗадачаИсполнителя.ГруппаИсполнителей КАК ГруппаИсполнителей,
		|	ЗадачаИсполнителя.ТекстЗадачи КАК ТекстЗадачи
		|ПОМЕСТИТЬ _ЗадачаИсполнителя
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбучениеСотрудников КАК ОбучениеСотрудников
		|		ПО ЗадачаИсполнителя.Основание = ОбучениеСотрудников.Ссылка
		|ГДЕ
		|	НЕ ЗадачаИсполнителя.ПометкаУдаления
		|	И НЕ ЕСТЬNULL(ЗадачаИсполнителя.БизнесПроцесс.Отменен, ЛОЖЬ)
		|	И НЕ ЗадачаИсполнителя.Выполнена
		|	И ЗадачаИсполнителя.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗадачаИсполнителя.Организация = &Организация
		|	И (НЕ &ТолькоЗадачиНаОбучениеИПроверкуЗнаний
		|			ИЛИ ЗадачаИсполнителя.ТочкаМаршрута В (&ТочкаМаршрутаПройтиОбучение, &ТочкаМаршрутаПроверитьЗнания))
		|	И &ВидПеречня В (ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.), ОбучениеСотрудников.ВидПеречня)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникПользователи.Ссылка КАК Пользователь,
		|	СправочникПользователи.АдресЭлектроннойПочты КАК АдресЭлектроннойПочты,
		|	_ЗадачаИсполнителя.Ссылка КАК Задача,
		|	_ЗадачаИсполнителя.Наименование КАК ЗадачаНаименование,
		|	_ЗадачаИсполнителя.Исполнитель КАК Исполнитель,
		|	_ЗадачаИсполнителя.ГруппаИсполнителей КАК ГруппаИсполнителей,
		|	_ЗадачаИсполнителя.СрокИсполнения КАК СрокИсполнения,
		|	_ЗадачаИсполнителя.ТекстЗадачи КАК ТекстЗадачи,
		|	&ИнтерактивныйЗапуск КАК ИнтерактивныйЗапуск
		|ИЗ
		|	_ЗадачаИсполнителя КАК _ЗадачаИсполнителя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставГруппПользователей КАК СоставГруппПользователей
		|		ПО (_ЗадачаИсполнителя.ГруппаИсполнителей <> ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.))
		|			И (_ЗадачаИсполнителя.ГруппаИсполнителей В (СоставГруппПользователей.ГруппаПользователей, СоставГруппПользователей.ГруппаПользователей.Родитель))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК СправочникПользователи
		|		ПО (СправочникПользователи.Ссылка В (СоставГруппПользователей.Пользователь, _ЗадачаИсполнителя.Исполнитель))
		|			И (СправочникПользователи.Организация = &Организация)
		|ГДЕ
		|	(СправочникПользователи.Ссылка = &Исполнитель
		|			ИЛИ &Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.))";
	
	Если НЕ ИнтерактивныйЗапуск Тогда
		Запрос.Текст = Запрос.Текст + "
			|ИТОГИ ПО
			|	Пользователь";
	КонецЕсли;	
	
#КонецОбласти	
	
	Возврат Запрос.Выполнить();
	
	
КонецФункции

#КонецОбласти

#Область ЗадачиПриВыходеНаРаботу

Процедура СформироватьОтчетПоЗадачамПриВыходеНаРаботу(ДокументРезультат, Исполнитель, Выборка = Неопределено)
	
	Макет = ПолучитьМакет("ОтчетПоЗадачамПриВыходеНаРаботу");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ОбластьШапка.Параметры.Пользователь = Исполнитель;
	ОбластьШапка.Параметры.Организация = ЭтотОбъект.Организация;
	ОбластьШапка.Параметры.ВидПеречня  = ?(ЭтотОбъект.ВидПеречня.Пустая(), "Все", ЭтотОбъект.ВидПеречня);
	ОбластьШапка.Параметры.Период      = ПредставлениеПериода(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания);
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	Если Выборка = Неопределено Тогда
		Выборка = ПолучитьВыборкуЗадачПриВыходеНаРаботу(Исполнитель, Истина).Выбрать();
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		
		Если НЕ Выборка.ИнтерактивныйЗапуск Тогда
			ОбластьСтрока.Параметры.Задача = ОбщегоНазначения.ПолучитьГиперссылкуНаОбъект(Выборка.Задача);
		КонецЕсли;
		
		ДокументРезультат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьВыборкуЗадачПриВыходеНаРаботу(Исполнитель, ИнтерактивныйЗапуск)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Исполнитель",		 Исполнитель);
	Запрос.УстановитьПараметр("Организация",		 ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ВидПеречня",		 	 ЭтотОбъект.ВидПеречня);
	Запрос.УстановитьПараметр("ДатаНачала",	   		 ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 		 ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ИнтерактивныйЗапуск", ИнтерактивныйЗапуск);
	
	Запрос.УстановитьПараметр("ТолькоЗадачиНаОбучениеИПроверкуЗнаний", ТолькоЗадачиНаОбучениеИПроверкуЗнаний);
	
	Запрос.УстановитьПараметр("ТочкаМаршрутаПройтиОбучение", БизнесПроцессы.ОбучениеСотрудника.ТочкиМаршрута.ПройтиОбучение);
	Запрос.УстановитьПараметр("ТочкаМаршрутаПроверитьЗнания", БизнесПроцессы.ОбучениеСотрудника.ТочкиМаршрута.ПроверитьЗнания);
	
#Область ТекстЗапроса

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПериодСтатусаПередРаботой.Сотрудник КАК Организация,
		|	ПериодСтатусаПередРаботой.Сотрудник КАК Сотрудник,
		|	ПериодСтатусаПередРаботой.ДатаУхода КАК ДатаУхода,
		|	ПериодСтатусаПередРаботой.ДатаВыхода КАК ДатаВыхода
		|ПОМЕСТИТЬ _СотрудникиВыходящиеНаРаботу
		|ИЗ
		|	(ВЫБРАТЬ
		|		СостояниеСотрудниковОрганизаций.Организация КАК Организация,
		|		СостояниеСотрудниковОрганизаций.Сотрудник КАК Сотрудник,
		|		МАКСИМУМ(ПредыдущееСостояниеСотрудниковОрганизаций.Период) КАК ДатаУхода,
		|		СостояниеСотрудниковОрганизаций.Период КАК ДатаВыхода
		|	ИЗ
		|		РегистрСведений.СостояниеСотрудниковОрганизаций КАК СостояниеСотрудниковОрганизаций
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеСотрудниковОрганизаций КАК ПредыдущееСостояниеСотрудниковОрганизаций
		|			ПО СостояниеСотрудниковОрганизаций.Организация = ПредыдущееСостояниеСотрудниковОрганизаций.Организация
		|				И СостояниеСотрудниковОрганизаций.Сотрудник = ПредыдущееСостояниеСотрудниковОрганизаций.Сотрудник
		|				И СостояниеСотрудниковОрганизаций.Период > ПредыдущееСостояниеСотрудниковОрганизаций.Период
		|	ГДЕ
		|		СостояниеСотрудниковОрганизаций.Организация = &Организация
		|		И СостояниеСотрудниковОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И СостояниеСотрудниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудникаОрганизации.Работа)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СостояниеСотрудниковОрганизаций.Организация,
		|		СостояниеСотрудниковОрганизаций.Сотрудник,
		|		СостояниеСотрудниковОрганизаций.Период) КАК ПериодСтатусаПередРаботой
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеСотрудниковОрганизаций КАК СостояниеСотрудниковОрганизацийПередРаботой
		|		ПО ПериодСтатусаПередРаботой.Организация = СостояниеСотрудниковОрганизацийПередРаботой.Организация
		|			И ПериодСтатусаПередРаботой.Сотрудник = СостояниеСотрудниковОрганизацийПередРаботой.Сотрудник
		|			И ПериодСтатусаПередРаботой.ДатаУхода = СостояниеСотрудниковОрганизацийПередРаботой.Период
		|ГДЕ
		|	СостояниеСотрудниковОрганизацийПередРаботой.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудникаОрганизации.Работа)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадачаИсполнителя.Ссылка КАК Ссылка,
		|	ЗадачаИсполнителя.Наименование КАК Наименование,
		|	ЗадачаИсполнителя.Исполнитель КАК Исполнитель,
		|	ЗадачаИсполнителя.ГруппаИсполнителей КАК ГруппаИсполнителей,
		|	ЗадачаИсполнителя.СрокИсполнения КАК СрокИсполнения,
		|	ЗадачаИсполнителя.ТекстЗадачи КАК ТекстЗадачи
		|ПОМЕСТИТЬ _ЗадачаИсполнителя
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбучениеСотрудников КАК ОбучениеСотрудников
		|		ПО ЗадачаИсполнителя.Основание = ОбучениеСотрудников.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.ОбучениеСотрудника КАК БП_ОбучениеСотрудника
		|		ПО ЗадачаИсполнителя.БизнесПроцесс = БП_ОбучениеСотрудника.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СотрудникиВыходящиеНаРаботу КАК _СотрудникиВыходящиеНаРаботу
		|		ПО (БП_ОбучениеСотрудника.Сотрудник = _СотрудникиВыходящиеНаРаботу.Сотрудник)
		|ГДЕ
		|	НЕ ЗадачаИсполнителя.ПометкаУдаления
		|	И НЕ ЕСТЬNULL(ЗадачаИсполнителя.БизнесПроцесс.Отменен, ЛОЖЬ)
		|	И НЕ ЗадачаИсполнителя.Выполнена
		|	И ЗадачаИсполнителя.СрокИсполнения МЕЖДУ _СотрудникиВыходящиеНаРаботу.ДатаУхода И _СотрудникиВыходящиеНаРаботу.ДатаВыхода
		|	И ЗадачаИсполнителя.Организация = &Организация
		|	И (НЕ &ТолькоЗадачиНаОбучениеИПроверкуЗнаний
		|			ИЛИ ЗадачаИсполнителя.ТочкаМаршрута В (&ТочкаМаршрутаПройтиОбучение, &ТочкаМаршрутаПроверитьЗнания))
		|	И &ВидПеречня В (ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.), ОбучениеСотрудников.ВидПеречня)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникПользователи.Ссылка КАК Пользователь,
		|	СправочникПользователи.АдресЭлектроннойПочты КАК АдресЭлектроннойПочты,
		|	_ЗадачаИсполнителя.Ссылка КАК Задача,
		|	_ЗадачаИсполнителя.Наименование КАК ЗадачаНаименование,
		|	_ЗадачаИсполнителя.Исполнитель КАК Исполнитель,
		|	_ЗадачаИсполнителя.ГруппаИсполнителей КАК ГруппаИсполнителей,
		|	_ЗадачаИсполнителя.СрокИсполнения КАК СрокИсполнения,
		|	_ЗадачаИсполнителя.ТекстЗадачи КАК ТекстЗадачи,
		|	&ИнтерактивныйЗапуск КАК ИнтерактивныйЗапуск
		|ИЗ
		|	_ЗадачаИсполнителя КАК _ЗадачаИсполнителя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставГруппПользователей КАК СоставГруппПользователей
		|		ПО (_ЗадачаИсполнителя.ГруппаИсполнителей <> ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.))
		|			И (_ЗадачаИсполнителя.ГруппаИсполнителей В (СоставГруппПользователей.ГруппаПользователей, СоставГруппПользователей.ГруппаПользователей.Родитель))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК СправочникПользователи
		|		ПО (СправочникПользователи.Ссылка В (СоставГруппПользователей.Пользователь, _ЗадачаИсполнителя.Исполнитель))
		|			И (СправочникПользователи.Организация = &Организация)
		|ГДЕ
		|	(СправочникПользователи.Ссылка = &Исполнитель
		|			ИЛИ &Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.))";
	
	Если НЕ ИнтерактивныйЗапуск Тогда
		Запрос.Текст = Запрос.Текст + "
			|ИТОГИ ПО
			|	Пользователь";
	КонецЕсли;	
	
#КонецОбласти	
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти
